<h4> Análise de Dados com Python <br> <b> Aula 4 <b> </h4>

<b><h5> Introdução ao Pandas II </h5></b>

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Aula passada.
df = pd.read_excel("bank-full_dup.xlsx", sheet_name = "Dados")

In [3]:
#Modificando todos os nomes das colunas. (Aula passada)
df.columns = ["idade", "emprego", "estado civil", "educacao", "default","balance","housing", "emprestimo", 
              "contato", "dia", "mes", "duracao", "campanha", "pdays", "previous", "poutcame"]

In [7]:
df.tail(1)

,idade,emprego,estado civil,educacao,default,balance,housing,emprestimo,contato,dia,mes,duracao,campanha,pdays,previous,poutcame
45220,47,management,single,tertiary,no,311,yes,yes,cellular,9,nov,255.0,3,378,2,failure

In [24]:
#Verificando frequência dos dados
((df.educacao.value_counts()/df.educacao.value_counts().sum()))

secondary    0.513169
tertiary     0.294222
primary      0.151500
unknown      0.041109
Name: educacao, dtype: float64

In [26]:
#ou
df["estado civil"].value_counts()/df["estado civil"].value_counts().sum()

married     0.601977
single      0.282877
divorced    0.115146
Name: estado civil, dtype: float64

In [29]:
#Obtendo a média dos dados
df.balance.mean()

1362.2178854956767

In [32]:
df.duracao.mean()

258.1900685689007

In [40]:
#Obtendo a média dos dados com uma lista de variáveis
df[["balance", "duracao"]].mean()

balance    1362.217885
duracao     258.190069
dtype: float64

In [43]:
#Obtendo a soma dos valores dos dados
df.balance.sum()

1362.2178854956767

In [57]:
round((df.duracao.sum()/(df.shape[0]-df.duracao.isnull().sum())),6)

258.190069

In [117]:
#Obtendo a soma dos dados com uma lista de variáveis
series_medias = df[["pdays","duracao","balance"]].sum()
for i in series_medias.index:
    display(series_medias[i]/(df.shape[0]-df[i].isnull().sum()))
#df_medias['pdays']/(df.shape[0]-df.pdays.isnull().sum())
#Exercício extra
#display(df['pdays'].mean())
#display(df['duracao'].mean())
#display(df['balance'].mean())

40.214391543751795

258.1900685689007

1362.2178854956767

Index(['pdays', 'duracao', 'balance'], dtype='object')

In [63]:
#Verificação dos valores únicos do dataframe
#df.emprego.unique()
display(len(df['estado civil'].unique()))
display(df['estado civil'].nunique())

3

3

In [24]:
#Verificação dos valores únicos do dataframe (quantidade)
df.emprego.nunique()

12

In [81]:
#Verificação da quantidade de dados duplicados
df.duplicated().sum()

10

In [80]:
#Verificando quais são os dados duplicados com o loc
#display(df.loc[df.duplicated()])
#display(df.loc[~df.duplicated()].shape[0])

,idade,emprego,estado civil,educacao,default,balance,housing,emprestimo,contato,dia,mes,duracao,campanha,pdays,previous,poutcame
1,44,technician,single,secondary,no,29,yes,no,NaN,5,may,151.0,1,-1,0,unknown
45211,44,technician,single,secondary,no,29,yes,no,NaN,5,may,151.0,1,-1,0,unknown

In [82]:
#Deletando as linhas duplicadas e armazenando os dados em um novo dataframe sem duplicidades
df2 = df.drop_duplicates()#subset para apagar duplicados em apenas algum(ns) campo(s)

In [83]:
#Verificando que não há duplicidades
df2.duplicated().sum()

0

In [29]:
#Verificando dados faltantes
df.isna().sum()

idade            0
emprego          0
estado civil     0
educacao         0
default          0
balance          0
housing          0
emprestimo       0
contato         76
dia              0
mes              0
duracao         11
campanha         0
pdays            0
previous         0
poutcame         0
dtype: int64

In [30]:
#ou
df.isnull().sum()

idade            0
emprego          0
estado civil     0
educacao         0
default          0
balance          0
housing          0
emprestimo       0
contato         76
dia              0
mes              0
duracao         11
campanha         0
pdays            0
previous         0
poutcame         0
dtype: int64

In [88]:
#Criando um novo dataframe sem dados faltantes ou nulos com o dropna
df3 = df.dropna()

In [89]:
#Verificando que não há dados faltantes/nulos
df3.isna().sum()

idade           0
emprego         0
estado civil    0
educacao        0
default         0
balance         0
housing         0
emprestimo      0
contato         0
dia             0
mes             0
duracao         0
campanha        0
pdays           0
previous        0
poutcame        0
dtype: int64

In [100]:
#Substituindo os dados faltantes por um novo valor
df4 = df.fillna("desconhecido")
df4.head()

,idade,emprego,estado civil,educacao,default,balance,housing,emprestimo,contato,dia,mes,duracao,campanha,pdays,previous,poutcame
0,58,management,married,tertiary,no,2143,yes,no,desconhecido,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,desconhecido,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,desconhecido,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,desconhecido,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,desconhecido,5,may,198,1,-1,0,unknown

In [95]:
df4.head()

,idade,emprego,estado civil,educacao,default,balance,housing,emprestimo,contato,dia,mes,duracao,campanha,pdays,previous,poutcame
0,58,management,married,tertiary,no,2143,yes,no,abc,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,abc,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,abc,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,abc,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,abc,5,may,198,1,-1,0,unknown

----------------------------
<h2> Atividade 1</h2>
<i> Hora de Praticar </i>

--------------------

In [190]:
#Criando dataframe o qual iremos utilizar
dados1 = {
        'ID': ['1', '2', '3', '4', '5'],
        'nome': ['Paula', 'Claudia', 'Joao', 'Carlos', 'Ana'], 
        'sobrenome': ['Pereira', 'Silva', 'Silveira', 'Bezerra', 'Souza']}
df1 = pd.DataFrame(dados1, columns = ['ID', 'nome', 'sobrenome'])
display('df1')
display(df1)

dados2 = {
        'ID': ['4', '5', '6', '7', '8'],
        'nome': ['Eder', 'Joana', 'Paulo', 'Pedro', 'Bete'], 
        'sobrenome': ['Silva', 'Bezerra', 'Fernandes', 'Brito', 'Oliveira']}
df2 = pd.DataFrame(dados2, columns = ['ID', 'nome', 'sobrenome'])
display('df2')
display(df2)

notas = {
        'ID': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'notas_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_notas = pd.DataFrame(notas, columns = ['ID','notas_id'])
display('df_notas')
display(df_notas)

'df1'

  ID     nome sobrenome
0  1    Paula   Pereira
1  2  Claudia     Silva
2  3     Joao  Silveira
3  4   Carlos   Bezerra
4  5      Ana     Souza

'df2'

  ID   nome  sobrenome
0  4   Eder      Silva
1  5  Joana    Bezerra
2  6  Paulo  Fernandes
3  7  Pedro      Brito
4  8   Bete   Oliveira

'df_notas'

   ID  notas_id
0   1        51
1   2        15
2   3        15
3   4        61
4   5        16
5   7        14
6   8        15
7   9         1
8  10        61
9  11        16

In [121]:
#Concatenando dataframes
df_1_2 = pd.concat([df1,df2], axis = 0)
df_1_2

  ID     nome  sobrenome
0  1    Paula    Pereira
1  2  Claudia      Silva
2  3     Joao   Silveira
3  4   Carlos    Bezerra
4  5      Ana      Souza
0  4     Eder      Silva
1  5    Joana    Bezerra
2  6    Paulo  Fernandes
3  7    Pedro      Brito
4  8     Bete   Oliveira

In [184]:
#Concatenando pelas colunas (axis=1)
#pd.concat([df1,df2], axis=1)
#df2.reset_index(drop=True)
df1.sort_values(by=['ID'], ascending=False,inplace=True)
df2.sort_values(by=['ID'], ascending=False,inplace=True)
if (not pd.isnull(df2.index.name)) and  (not 'ID' in df2.index.name):
    df2.set_index(['ID'],inplace=True)
#df1.set_index(['ID'],inplace=True)
#pd.concat([df1,df2], axis=1)

In [189]:
pd.isnull(df2.index.name)

True

In [176]:
df1.index.name

'ID'

In [178]:
df2.reset_index(inplace=True)

In [38]:
#Concatenando pelas linhas (axis=0)
pd.concat([df1,df2], axis=0)

  ID     nome  sobrenome
0  1    Paula    Pereira
1  2  Claudia      Silva
2  3     Joao   Silveira
3  4   Carlos    Bezerra
4  5      Ana      Souza
0  4     Eder      Silva
1  5    Joana    Bezerra
2  6    Paulo  Fernandes
3  7    Pedro      Brito
4  8     Bete   Oliveira

In [212]:
# Unindo os dataframes através do merge, utilizando a coluna de interesse (chave)
pd.merge(df_1_2, df_notas, on="ID", how='outer')
#pd.merge(df_1_2, df_notas, right_on="ID", left_on="ID")

    ID     nome  sobrenome  notas_id
0    1    Paula    Pereira      51.0
1    2  Claudia      Silva      15.0
2    3     Joao   Silveira      15.0
3    4   Carlos    Bezerra      61.0
4    4     Eder      Silva      61.0
5    5      Ana      Souza      16.0
6    5    Joana    Bezerra      16.0
7    6    Paulo  Fernandes       NaN
8    7    Pedro      Brito      14.0
9    8     Bete   Oliveira      15.0
10   9      NaN        NaN       1.0
11  10      NaN        NaN      61.0
12  11      NaN        NaN      16.0

In [211]:
df_notas

   ID  notas_id
0   1        51
1   2        15
2   3        15
3   4        61
4   5        16
5   7        14
6   8        15
7   9         1
8  10        61
9  11        16

----------------------------
<h2> Atividade 2</h2>
<i> Hora de Praticar </i>

----------------

In [213]:
#Agrupando os dados pela variável escolhida
df.groupby("emprestimo")

In [221]:
#Visualizando os grupos
df.groupby("emprestimo").groups['no']

Int64Index([    0,     1,     3,     4,     5,     7,     8,     9,    10,
               11,
            ...
            45209, 45210, 45211, 45213, 45214, 45215, 45216, 45217, 45218,
            45219],
           dtype='int64', length=37975)

In [53]:
#Agrupando pelas variáveis empréstimo e emprego
df.groupby(["emprestimo","emprego"])

In [54]:
#Visualizando os grupos
df.groupby(["emprestimo","emprego"]).groups

{('no',
  'admin.'): Int64Index([   10,    11,    16,    25,    38,    39,    45,    53,    60,
                80,
             ...
             45142, 45144, 45147, 45162, 45167, 45171, 45173, 45176, 45177,
             45202],
            dtype='int64', length=4180),
 ('no',
  'blue-collar'): Int64Index([    3,    17,    33,    36,    42,    50,    57,    58,    62,
                64,
             ...
             45100, 45124, 45127, 45135, 45174, 45178, 45181, 45190, 45199,
             45209],
            dtype='int64', length=8048),
 ('no',
  'entrepreneur'): Int64Index([    7,    94,   172,   222,   232,   241,   256,   264,   273,
               357,
             ...
             44652, 44691, 44792, 44845, 44969, 45083, 45140, 45155, 45175,
             45210],
            dtype='int64', length=1131),
 ('no',
  'housemaid'): Int64Index([  140,   212,   218,   400,   471,   531,   755,   757,  1076,
              1096,
             ...
             44551, 44613, 44688, 44766, 44814, 44858, 44938, 44943, 45029,
             45152],
            dtype='int64', length=1088),
 ('no',
  'management'): Int64Index([    0,     5,    21,    26,    28,    31,    34,    41,    49,
                51,
             ...
             45156, 45161, 45169, 45188, 45192, 45197, 45198, 45201, 45214,
             45219],
            dtype='int64', length=8207),
 ('no',
  'retired'): Int64Index([    8,    15,    18,    43,    44,    66,    89,    97,   108,
               114,
             ...
             45168, 45180, 45183, 45184, 45191, 45195, 45204, 45207, 45208,
             45215],
            dtype='int64', length=1956),
 ('no',
  'self-employed'): Int64Index([   46,   141,   201,   279,   289,   402,   443,   447,   469,
               548,
             ...
             44934, 44997, 45003, 45004, 45013, 45030, 45061, 45097, 45136,
             45193],
            dtype='int64', length=1350),
 ('no',
  'services'): Int64Index([   14,    19,    23,    40,    59,    63,    77,    79,    81,
               110,
             ...
             44951, 44966, 45027, 45145, 45159, 45164, 45185, 45187, 45189,
             45216],
            dtype='int64', length=3319),
 ('no',
  'student'): Int64Index([  151,   203,   265,   292,   297,   369,   552,   647,   650,
               690,
             ...
             45107, 45112, 45116, 45133, 45143, 45148, 45158, 45170, 45196,
             45203],
            dtype='int64', length=926),
 ('no',
  'technician'): Int64Index([    1,     9,    12,    13,    35,    37,    47,    48,    61,
                68,
             ...
             45160, 45165, 45172, 45179, 45182, 45200, 45206, 45211, 45213,
             45218],
            dtype='int64', length=6291),
 ('no',
  'unemployed'): Int64Index([  134,   142,   147,   176,   217,   220,   387,   417,   463,
               493,
             ...
             44937, 44956, 44988, 45031, 45038, 45071, 45089, 45128, 45146,
             45166],
            dtype='int64', length=1194),
 ('no',
  'unknown'): Int64Index([    4,   216,   354,   876,  1072,  1292,  2046,  2723,  2841,
              2848,
             ...
             44544, 44651, 44656, 44681, 44714, 44742, 44970, 45141, 45186,
             45217],
            dtype='int64', length=285),
 ('yes',
  'admin.'): Int64Index([   32,   107,   126,   133,   281,   363,   371,   456,   500,
               516,
             ...
             44866, 44918, 44947, 44971, 44982, 45007, 45043, 45064, 45074,
             45103],
            dtype='int64', length=991),
 ('yes',
  'blue-collar'): Int64Index([   20,    22,    69,    70,    76,   188,   239,   251,   268,
               308,
             ...
             43660, 43730, 43951, 43983, 44069, 44182, 44478, 44600, 44822,
             44924],
            dtype='int64', length=1684),
 ('yes',
  'entrepreneur'): Int64Index([    2,    27,    55,   515,   634,   894,   987,  1355,  1430,
              1890,
             ...
             38898, 39126, 39233, 40396, 41471, 41769, 43810, 44705, 45122,
             45212],
            dtype='int64', length=357),
 ('yes',
  'housemaid'): Int64Index([  882,  1772,  3446,  3520,  3725,  3925,  6389,  8040,  9110,
              9134,
             ...
             36256, 37255, 37486, 37808, 39712, 40692, 40765, 41657, 42991,
             44682],
            dtype='int64', length=152),
 ('yes',
  'management'): Int64Index([    6,    72,    88,    95,   206,   219,   270,   388,   453,
               487,
             ...
             44641, 44795, 44816, 44887, 44974, 45039, 45059, 45151, 45194,
             45220],
            dtype='int64', length=1254),
 ('yes',
  'retired'): Int64Index([   24,   223,   465,   575,   593,   930,   976,  1115,  1226,
              1541,
             ...
             41227, 41459, 41523, 42508, 43067, 43263, 43284, 44281, 44745,
             45153],
            dtype='int64', length=309),
 ('yes',
  'self-employed'): Int64Index([   84,   112,  1367,  1502,  1620,  1896,  2311,  2564,  2946,
              3147,
             ...
             39690, 41356, 41801, 41942, 42563, 43422, 43476, 43856, 44222,
             44505],
            dtype='int64', length=229),
 ('yes',
  'services'): Int64Index([   71,    78,   123,   127,   171,   258,   312,   313,   381,
               385,
             ...
             40420, 40430, 40990, 40998, 41835, 43070, 44061, 44177, 44201,
             44596],
            dtype='int64', length=836),
 ('yes',
  'student'): Int64Index([ 6203, 13134, 15223, 28123, 30370, 30632, 31143, 34376, 37763,
             40309, 40316, 44076],
            dtype='int64'),
 ('yes',
  'technician'): Int64Index([   29,    30,    54,    91,   124,   197,   240,   337,   395,
               401,
             ...
             44084, 44091, 44161, 44294, 44369, 44498, 44873, 45069, 45108,
             45205],
            dtype='int64', length=1309),
 ('yes',
  'unemployed'): Int64Index([ 1521,  1798,  2198,  2862,  3277,  3715,  3862,  4219,  4791,
              4934,
             ...
             35153, 35525, 35634, 39109, 42084, 42466, 43344, 43850, 44754,
             44855],
            dtype='int64', length=109),
 ('yes', 'unknown'): Int64Index([3324, 6558, 25762, 33195], dtype='int64')}

In [55]:
#Aplicando funções sobre os agrupamentos
df.groupby("emprestimo").mean()

,idade,balance,dia,duracao,campanha,pdays,previous
emprestimo,,,,,,,
no,41.011244,1474.428993,15.764450,259.587868,2.750125,41.204687,0.592153
yes,40.555479,774.139387,16.020563,250.864163,2.834391,35.024427,0.522219

In [224]:
df.groupby("emprestimo").count()
#df.emprestimo.value_counts()

,idade,emprego,estado civil,educacao,default,balance,housing,contato,dia,mes,duracao,campanha,pdays,previous,poutcame
emprestimo,,,,,,,,,,,,,,,
no,37975,37975,37975,37975,37975,37975,37975,37910,37975,37975,37966,37975,37975,37975,37975
yes,7246,7246,7246,7246,7246,7246,7246,7235,7246,7246,7244,7246,7246,7246,7246

In [57]:
df.groupby(["emprestimo","estado civil"]).mean()

                             idade      balance        dia     duracao  \
emprestimo estado civil
no         divorced      46.012133  1278.097993  15.688521  262.818585
           married       43.663446  1548.183990  15.810647  255.551408
           single        33.708034  1400.515277  15.700036  266.525791
yes        divorced      44.716612   717.111835  16.298588  261.144408
           married       42.185368   834.025531  16.061360  243.327039
           single        33.686899   637.957332  15.752404  266.291040

                         campanha      pdays  previous
emprestimo estado civil
no         divorced      2.602193  43.178721  0.575362
           married       2.838305  38.417136  0.564603
           single        2.628325  46.095884  0.654475
yes        divorced      2.764387  30.870793  0.439739
           married       2.863120  35.792534  0.523493
           single        2.792668  35.171875  0.564303

In [226]:
df.groupby(["emprestimo","estado civil"]).agg(["count","median"])

                         idade        balance           dia        duracao  \
                         count median   count median  count median   count
emprestimo estado civil
no         divorced       4286     45    4286    385   4286     16    4283
           married       22561     42   22561    524  22561     16   22555
           single        11128     32   11128    482  11128     16   11128
yes        divorced        921     45     921    199    921     17     921
           married        4661     41    4661    278   4661     17    4660
           single         1664     32    1664    229   1664     16    1663

                               campanha         pdays        previous
                        median    count median  count median    count median
emprestimo estado civil
no         divorced      180.0     4286      2   4286     -1     4286      0
           married       179.0    22561      2  22561     -1    22561      0
           single        188.0    11128      2  11128     -1    11128      0
yes        divorced      170.0      921      2    921     -1      921      0
           married       171.0     4661      2   4661     -1     4661      0
           single        186.0     1664      2   1664     -1     1664      0

In [304]:
def média(valor):
    return valor.sum()/len(valor)

def agrupa(lista):
    lista_def = []
    for l in lista:
        lista_def.append(l)
    return lista_def
    #return ','.join(lista)
    
def agrupa_conta(lista):
    dict_conta = {}
    for l in lista:
        if l in dict_conta.keys():
            dict_conta[l] = dict_conta[l] + 1
        else:
            dict_conta[l] = 1
    return dict_conta    

df_agrupa = df.groupby(["emprestimo","housing"]).agg({'emprego':agrupa_conta, 'educacao':agrupa_conta})
#df.groupby(["emprestimo","housing"]).agg(["count","mean",média])
df_agrupa.reset_index(inplace=True)
df_agrupa[(df_agrupa.emprestimo=='no') & (df_agrupa.housing=='no')]['emprego'][0]

{'unknown': 261,
 'technician': 2990,
 'retired': 1566,
 'services': 1091,
 'admin.': 1602,
 'management': 4235,
 'entrepreneur': 471,
 'blue-collar': 2133,
 'unemployed': 714,
 'housemaid': 750,
 'self-employed': 715,
 'student': 681}

In [298]:
df[(df.emprestimo=='no') & (df.housing=='no')]['emprego'].value_counts()

management       4235
technician       2990
blue-collar      2133
admin.           1602
retired          1566
services         1091
housemaid         750
self-employed     715
unemployed        714
student           681
entrepreneur      471
unknown           261
Name: emprego, dtype: int64

In [315]:
def divide_idade(valor):
    return valor/2
df['idade_2'] = df['idade'].apply(divide_idade)

In [337]:
def traduz(mes):
    if mes=='jan':
        return 'janeiro'
    else:
        if mes=='feb':
            return 'fevereiro'
        else:
            if mes=='mar':
                return 'março'
            else:
                if mes=='apr':
                    return 'abril'
                else:
                    if mes=='may':
                        return 'maio'
                    else:
                        if mes=='jun':
                            return 'junho'
                        else:
                            if mes=='jul':
                                return 'julho'
                            else:
                                if mes=='aug':
                                    return 'agosto'
                                else:
                                    if mes=='sep':
                                        return 'setembro'
                                    else:
                                        if mes=='oct':
                                            return 'outubro'
                                        else:
                                            if mes=='nov':
                                                return 'novembro'
                                            else:
                                                if mes=='dec':
                                                    return 'dezembro'

df['mes_novo'] = df['mes'].apply(traduz)
df['mes'].value_counts()

may    13768
jul     6895
aug     6247
jun     5341
nov     3978
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: mes, dtype: int64

In [339]:
def tradutor(valor):
    if valor<=15:
        return 'criança'
    else:
        if valor<=25:
            return 'adolescente'
        else:
            if valor<=60:
                return 'adulto'

In [339]:
            else:
                return 'idoso'
#faixa de idade - até <15 crianca, >=15<=25 adolescente,>=26<=60 adulto,>60idoso
df['faixa'] = df['idade'].apply(tradutor)
df['faixa'].value_counts()

adulto         42695
adolescente     1336
idoso           1190
Name: faixa, dtype: int64

In [62]:
#Utilizando a função transposta
df.groupby(["emprestimo","housing"]).agg(["count","median"]).T

emprestimo            no              yes
housing               no      yes      no     yes
idade    count   17209.0  20766.0  2877.0  4369.0
         median     42.0     37.0    43.0    38.0
balance  count   17209.0  20766.0  2877.0  4369.0
         median    580.0    444.0   230.0   273.0
dia      count   17209.0  20766.0  2877.0  4369.0
         median     17.0     15.0    17.0    16.0
duracao  count   17207.0  20759.0  2875.0  4369.0
         median    179.0    183.0   171.0   176.0
campanha count   17209.0  20766.0  2877.0  4369.0
         median      2.0      2.0     2.0     2.0
pdays    count   17209.0  20766.0  2877.0  4369.0
         median     -1.0     -1.0    -1.0    -1.0
previous count   17209.0  20766.0  2877.0  4369.0
         median      0.0      0.0     0.0     0.0

----------------------------
<h2> Atividade 3</h2>
<i> Hora de Praticar </i>